
# üß© Titanic Dataset Exploration with pandas

üéØ **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why it‚Äôs useful.

In [3]:
import pandas as pd

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")

# Show first few rows
df.head()

ModuleNotFoundError: No module named 'pandas'


## üß† Step 1: Inspecting the Data

Functions to explore:
- df.head()
- df.tail()
- df.info()
- df.describe()
- df.shape
- df.columns

In [7]:

# Example: df.head()
df.head()

# Example 2
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

UTILIDAD

df.head() sirve para mostrar las primeras filas de un DataFrame en pandas, 
lo cual es √∫til para una inspecci√≥n r√°pida de los datos y tener una idea de su contenido.

In [ ]:
df.tail(5)
df.tail(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

UTILIDAD

df.tail() sirve para obtener las √∫ltimas filas de un DataFrame de Pandas. Por defecto, devuelve las √∫ltimas 5 filas, pero se le puede especificar un n√∫mero para obtener un n√∫mero diferente de filas

In [ ]:
df.info()

UTILIDAD

Sirve para obtener un resumen conciso de un DataFrame, mostrando informaci√≥n clave como el tipo de datos de cada columna, el n√∫mero de valores no nulos, y el uso total de memoria. Es una herramienta fundamental para la exploraci√≥n inicial de datos, ya que proporciona una visi√≥n r√°pida del tama√±o, el contenido y la estructura del conjunto de datos.

In [18]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

UTILIDAD

Genera un resumen estad√≠stico para las columnas num√©ricas de un DataFrame, incluyendo el recuento, la media, la desviaci√≥n est√°ndar, el m√≠nimo, el m√°ximo y los cuartiles (25%, 50% y 75%). 

El resumen tambi√©n puede incluir estad√≠sticas para columnas no num√©ricas o incluir percentiles personalizados utilizando los par√°metros include y percentiles.

In [20]:
df.shape

(891, 12)

UTILIDAD

Se utiliza para obtener el n√∫mero de filas y columnas de un DataFrame de Pandas. 

Devuelve una tupla (filas, columnas) que permite entender r√°pidamente las dimensiones de la tabla de datos.

In [33]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Sirve para obtener los nombres de las columnas de un DataFrame de Pandas. Este atributo devuelve un objeto Index que contiene todas las etiquetas de las columnas, las cuales se pueden convertir f√°cilmente a una lista o utilizar para realizar otras operaciones.


## üîç Step 2: Selecting Data

Functions to explore:
- df["column"]
- df[["col1", "col2"]]
- df.loc[]
- df.iloc[]

In [ ]:

# Example: Selecting columns
df["Age"].head()
df[["Sex", "Age", "Survived"]].head()

UTILIDAD

df["Age"].head() en Pandas selecciona la columna "Age" y muestra sus primeras 5 filas (por defecto), lo que es √∫til para previsualizar r√°pidamente los datos de esa columna. Tambien lo hace con Age y Survived

In [ ]:
df[["Sex", "Age"]]
df[["Name", "Fare"]]

UTILIDAD

Sirve para seleccionar varias columnas espec√≠ficas de un DataFrame.
Devuelve un nuevo DataFrame que contiene solo las columnas indicadas, en el orden en que las escribas.

In [5]:
df.loc[4,"Name"]
df.loc[3,"Fare"]

53.1

UTILIDAD

Es un m√©todo de selecci√≥n de datos por etiquetas (no por posici√≥n num√©rica) en un DataFrame.
Se usa para acceder a filas y columnas por sus nombres (etiquetas). Permite leer, filtrar y modificar datos de forma muy flexible.

In [7]:
df.iloc[:, 5]
df.iloc[:, 3]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object


## üîé Step 3: Filtering Rows

Functions to explore:
- df[df["Age"] > 30]
- df.query("Sex == 'female' and Survived == 1")

In [ ]:

# Example: Filtering data
df[df["Age"] > 50].head()
df.query("Sex == 'female' and Survived == 1").head()

UTILIDAD

Son formas del filtra datos en un Data frame.
Filtra las filas donde la columna "PassengerId" es mayor que 2.
Muestra las primeras 5 filas de personas que sobrevivieron

In [ ]:

df[df["Survived"] == 1].head()
df[df["PassengerId"] > 2].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

UTILIDAD
query() permite filtrar con una sintaxis tipo SQL o expresi√≥n l√≥gica dentro de una cadena de texto.Muestra las primeras 5 mujeres que no sobrevivieron

In [98]:

df.query("Sex == 'female' and Survived == 0").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,NaN,S
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S


## üßπ Step 4: Handling Missing Data

Functions to explore:
- df.isna()
- df.isna().sum()
- df.dropna()
- df.fillna()

In [ ]:

# Example: Check missing values
df.isna().sum()

# Fill missing ages with median
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Age"].head()

## UTILIDAD

Detectar valores faltantes (NaN) en un DataFrame.
Devuelve otro DataFrame del mismo tama√±o,pero con valores booleanos (False o true)

In [ ]:
df.isna()

## UTILIDAD
Se usa para contar cu√°ntos valores faltantes hay en cada columna de un DataFrame.
Te devuelve cu√°ntos datos faltan por columna dentro del DataFrame, con numeros, no con booleanos.

In [155]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

UTILIDAD

Elimina las filas que contienen valores faltantes (NaN o None) de un DataFrame.

In [156]:
df.dropna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

UTILIDAD

Se utiliza para rellenar valores faltantes (nulos, como NaN) en un DataFrame.
Reemplaza todos los valores faltantes por un valor dado, por ejemplo: No disponible

In [ ]:
df.fillna("No disponible")
df.fillna("Dato nulo")


## üìä Step 5: Grouping and Aggregating

Functions to explore:
- df.groupby("Sex")["Survived"].mean()
- df["Fare"].mean()
- df["Age"].median()

Agrupa el DataFrame df por la columna "Sex"
y calcula el promedio (mean) de la columna "Survived" para cada grupo.

In [ ]:
df.groupby("Sex")["Survived"].mean()

Agrupa el DataFrame df por la columna "Pclass"
y calcula el promedio (mean) de la columna "Fare" para cada grupo.

In [ ]:
df.groupby("Pclass")["Fare"].mean()

Devuelve la mediana de los valores num√©ricos de la columna "Age" del DataFrame

In [ ]:
df["Age"].median()

Devuelve la mediana de los valores num√©ricos de la columna "Fare" del DataFrame

In [13]:
df["Fare"].median()

14.4542

Devuelve el valor promedio (media aritm√©tica) de la columna "Fare" del DataFrame

In [14]:
df["Fare"].mean()

32.204207968574636

Devuelve el valor promedio (media aritm√©tica) de la columna "Age" del DataFrame

In [16]:
df["Age"].mean()

29.69911764705882

## UTILIDAD

Sirve para agrupar datos y calcular estad√≠sticas por grupo (como promedio, suma, conteo, etc.).


## üìà Step 6: Sorting and Counting

Functions to explore:
- df.sort_values("Age")
- df["Sex"].unique()
- df["Pclass"].value_counts()

## UTILIDAD
df.sort_values()
Sirve para ordenar el DataFrame por una columna, en este caso la edad.

In [ ]:

# Example: Sorting and counting
df.sort_values("Age").head()

In [ ]:
df.sort_values("Sex").head()


df[].unique()

Devuelve los valores √∫nicos de una columna.

In [ ]:
df["Fare"].unique()

In [ ]:
df["Sex"].unique()

df[].value_counts()

Cuenta cu√°ntas veces aparece cada valor en una columna (frecuencias).

In [ ]:
df["Pclass"].value_counts()

In [ ]:
df["Cabin"].value_counts()


## ‚öôÔ∏è Step 7: Creating or Modifying Columns

Functions to explore:
- df.assign()
- df.apply()
- df["new_col"] = ...
- pd.concat()
- pd.merge()

In [ ]:
# Example: Create new column
df["Fare_per_Age"] = df["Fare"] / df["Age"]
df[["Age", "Fare", "Fare_per_Age"]].head()


## UTILIDAD

Crea una o m√°s columnas nuevas o modifica columnas existentes sin alterar el DataFrame original (a menos que lo reasignes).
Devuelve una copia del DataFrame con las nuevas columnas.

In [21]:
df2 = df.assign(Fare_per_Year = df["Fare"] / df["Age"])
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_per_Year
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.329545
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.875876
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.304808
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.517143
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.230000

## UTILIDAD

Crea una o m√°s columnas nuevas o modifica columnas existentes sin alterar el DataFrame original (a menos que lo reasignes).
Devuelve una copia del DataFrame con las nuevas columnas.

In [ ]:
df["Age_group"] = df["Age"].apply(lambda x: "Child" if x < 18 else "Adult")
df[["Age", "Age_group"]].head()

# UTILIDAD

√ötil cuando la operaci√≥n no se puede expresar f√°cilmente con operaciones vectorizadas.
Se usa para crear nuevas columnas derivadas de una o varias existentes.

In [ ]:

df["Fare_per_Age"] = df["Fare"] / df["Age"]
df[["Age", "Fare", "Fare_per_Age"]].head()

La funcion Concat() es √∫til para apilar o unir datos, manteniendo o ajustando √≠ndices y etiquetas seg√∫n convenga, y se suele usar para combinar informaci√≥n en DataFrames o Series de pandas de forma flexible y eficiente.

In [5]:
a = df.head(2)   
b = df.tail(2)   

resultado = pd.concat([a, b])

print(resultado)

NameError: name 'df' is not defined

In [ ]:
df_datos = df[['PassengerId', 'Name', 'Sex', 'Age']]
df_pagos = df[['PassengerId', 'Fare', 'Embarked']]

df_unido = pd.concat([df_datos, df_pagos[['Fare', 'Embarked']]], axis=1)

print(df_unido.head())


## UTILIDAD

El m√©todo merge() en pandas sirve para combinar dos DataFrames en base a columnas o √≠ndices comunes.
Devuelve un nuevo DataFrame que combina las columnas seleccionadas de df1 y df2, unidas por la columna com√∫n PassengerId.

In [29]:
df1 = df[["PassengerId", "Name", "Sex"]]
df2 = df[["PassengerId", "Age", "Fare"]]
merged = df1.merge(df2, on="PassengerId")
merged.head()

,PassengerId,Name,Sex,Age,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,8.0500


## üíæ Step 8: Exporting Data

Function to explore:
- df.to_csv("output.csv", index=False)

## UTILIDAD

Guarda un DataFrame de pandas como un archivo CSV en tu computadora.

Permite guardar tus datos procesados o limpios para usarlos m√°s tarde.

In [ ]:

# Example: Save cleaned data
df.to_csv("titanic_dataset.csv", index=False)

df.to_csv("ejemplo.csv", index=False)


## üß© Step 9: Summary

Reflect on what you learned:
- Which functions were most useful?
- What insights did you gain from the Titanic dataset?


## Which functions were most useful?

Aprend√≠ a usar funciones clave de pandas como groupby(), apply(), assign(), merge() y to_csv() para limpiar, transformar y analizar datos.

## What insights did you gain from the Titanic dataset?

Del dataset del Titanic, descubr√≠ que las mujeres tuvieron una mayor tasa de supervivencia, que la mayor√≠a de los pasajeros eran adultos j√≥venes y que el precio del billete reflejaba diferencias sociales.